yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/FaceLandmark/main.cpp
    framebuffer_init0();
    framebuffer_init_from_image(&frameBuffer);

    for (i = 0 ; i < NUM_FRAMEBUF; i++)
    {
        s_asFramebuf[i].eState = eFRAMEBUF_EMPTY;
    }

    framebuffer_init_image(&s_asFramebuf[0].frameImage);

#if (NUM_FRAMEBUF == 2)
    s_asFramebuf[1].frameImage.w = GLCD_WIDTH;
    s_asFramebuf[1].frameImage.h = GLCD_HEIGHT;
    s_asFramebuf[1].frameImage.size = GLCD_WIDTH * GLCD_HEIGHT * 2;
    s_asFramebuf[1].frameImage.pixfmt = PIXFORMAT_RGB565;
    s_asFramebuf[1].frameImage.data = (uint8_t *)frame_buf1;
#endif
}

static void DrawFaceLandmark(
    const std::vector<arm::app::face_landmark::KeypointResult> &results,
	int posOffsetX,
	int posOffsetY,		
    image_t *drawImg
)
{
	int i;
	arm::app::face_landmark::KeypointResult keyPoint;
	int keypointSize = results.size();
	
	for(i = 0; i < keypointSize; i ++)
	{
		keyPoint = results[i];
		//draw points
		if(i < 468)
		{
			imlib_draw_circle(drawImg, posOffsetX + keyPoint.m_x, posOffsetY + keyPoint.m_y, 1, COLOR_R5_G6_B5_TO_RGB565(0, COLOR_G6_MAX, 0), 1, true);	
		}
		else
		{	
			imlib_draw_circle(drawImg, posOffsetX + keyPoint.m_x, posOffsetY + keyPoint.m_y, 1, COLOR_R5_G6_B5_TO_RGB565(0, 0, COLOR_B5_MAX), 1, true);	
		}
	}
}

/* Draw lip keypoints prominently (green circles) */
static void DrawLipLandmark(
    const std::vector<arm::app::face_landmark::KeypointResult> &results,
	int posOffsetX,
	int posOffsetY,
    image_t *drawImg
)
{
	if (results.size() < 468) return;
	for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
		int idx = s_i32LipLandmarkIndices[i];
		if (idx < (int)results.size()) {
			const auto &kp = results[idx];
			imlib_draw_circle(drawImg, posOffsetX + kp.m_x, posOffsetY + kp.m_y, 3, COLOR_R5_G6_B5_TO_RGB565(0, COLOR_G6_MAX, 0), 2, true);
		}
	}
}

/* Mouth Aspect Ratio: vertical mouth opening / horizontal width. High = mouth open (speaking) */
static float ComputeMAR(const std::vector<arm::app::face_landmark::KeypointResult> &results_KP)
{
    if (results_KP.size() < 468) return 0.0f;
    float x61 = results_KP[61].m_x, y61 = results_KP[61].m_y;
    float x291 = results_KP[291].m_x, y291 = results_KP[291].m_y;
    float y78 = results_KP[78].m_y, y14 = results_KP[14].m_y;
    float horiz = std::sqrt((x291-x61)*(x291-x61) + (y291-y61)*(y291-y61));
    if (horiz < 1.0f) return 0.0f;
    float vert = (float)std::fabs(y78 - y14);
    return vert / horiz;
}

/* Compute lip keypoint velocity (avg movement) using matched previous face */
static float ComputeLipVelocity(
    const std::vector<arm::app::face_landmark::KeypointResult> &results_KP,
    int prevFaceIdx,
    int posOffsetX,
    int posOffsetY
)
{
    float velocity = 0.0f;
    int validPoints = 0;

    if (results_KP.size() < 468 || prevFaceIdx < 0 || prevFaceIdx >= MAX_TRACKED_FACES || !s_asPrevLipState[prevFaceIdx].valid)
        return 0.0f;

    for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
        int idx = s_i32LipLandmarkIndices[i];
        if (idx >= (int)results_KP.size()) continue;

        float curX = posOffsetX + results_KP[idx].m_x;
        float curY = posOffsetY + results_KP[idx].m_y;
        float dx = curX - s_asPrevLipState[prevFaceIdx].lipX[i];
        float dy = curY - s_asPrevLipState[prevFaceIdx].lipY[i];
        velocity += (float)std::sqrt(dx*dx + dy*dy);
        validPoints++;
    }
    return (validPoints > 0) ? (velocity / validPoints) : 0.0f;
}

/* Find best-matching previous face by bbox center distance (for face order changes) */
static int FindMatchingPrevFace(int curX0, int curY0, int curW, int curH)
{
    int bestIdx = -1;
    float bestDist = 1e9f;
    int curCx = curX0 + curW / 2;
    int curCy = curY0 + curH / 2;

    for (int j = 0; j < MAX_TRACKED_FACES; j++) {
        if (!s_asPrevLipState[j].valid) continue;
        int prevCx = s_asPrevLipState[j].x0 + s_asPrevLipState[j].w / 2;
        int prevCy = s_asPrevLipState[j].y0 + s_asPrevLipState[j].h / 2;
        float dx = (float)(curCx - prevCx);
        float dy = (float)(curCy - prevCy);
        float dist = std::sqrt(dx*dx + dy*dy);
        if (dist < bestDist && dist < (float)(curW + curH) / 2) {  /* Must be within ~face size */
            bestDist = dist;
            bestIdx = j;
        }
    }
    return bestIdx;
}

/* Store current lip positions for next frame's velocity computation */
static void StoreLipPositions(
    const std::vector<arm::app::face_landmark::KeypointResult> &results_KP,
    int storeIdx,
    int posOffsetX,
    int posOffsetY,
    int faceX0, int faceY0, int faceW, int faceH
)
{
    if (storeIdx >= MAX_TRACKED_FACES || storeIdx < 0 || results_KP.size() < 468) return;

    for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
        int idx = s_i32LipLandmarkIndices[i];
        if (idx < (int)results_KP.size()) {
            s_asPrevLipState[storeIdx].lipX[i] = posOffsetX + results_KP[idx].m_x;
            s_asPrevLipState[storeIdx].lipY[i] = posOffsetY + results_KP[idx].m_y;
        }
    }
    s_asPrevLipState[storeIdx].x0 = faceX0;
    s_asPrevLipState[storeIdx].y0 = faceY0;
    s_asPrevLipState[storeIdx].w = faceW;
    s_asPrevLipState[storeIdx].h = faceH;
    s_asPrevLipState[storeIdx].valid = 1;
}

static void DrawDetectFace(
    std::vector<arm::app::face_detection::DetectionResult> &results,
    std::vector<bool> &isSpeaking,
    image_t *drawImg
)
{
	arm::app::face_detection::DetectionResult faceBox;
	int faceBoxSize = results.size();
	
	for(int i = 0; i < faceBoxSize; i ++)
	{
		faceBox = results[i];
		/* Green when speaking, blue otherwise */
		int boxColor = (i < (int)isSpeaking.size() && isSpeaking[i])
			? COLOR_R5_G6_B5_TO_RGB565(0, COLOR_G6_MAX, 0)  /* Green */
			: COLOR_B5_MAX;  /* Blue */
		imlib_draw_rectangle(drawImg, faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h, boxColor, 2, false);
		/* Draw "Speaking" label when speaking */
		if (i < (int)isSpeaking.size() && isSpeaking[i]) {
			imlib_draw_string(drawImg, faceBox.m_x0, faceBox.m_y0 - 14, "Speaking", COLOR_R5_G6_B5_TO_RGB565(0, COLOR_G6_MAX, 0), 1, 0, 0, false, 0, false, false, 0, false, false);
		}
	}
}

